#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time : 2019/12/25 17:55
# @Author : liuhuiling
print()
'''
-计算思维与程序设计
-计算生态与Python语言
-用户体验与软件产品
-基本的程序设计模式

3种人类思维：
    逻辑思维：推理和演绎，数学为代表，A-->B B-->C A-->C
    实证思维：实验和验证，物理为代表，提出引力波<-- 实验
    计算思维：设计和构造，计算机为代表，汉诺塔递归    课后练习题 

抽象和自动化
-计算思维：Computational Thinking
-抽象问题的计算过程，利用计算机自动化求解 （不抽象因果关系）
-计算思维是基于计算机的思维方式

举例：
1.计数求和：计算1-100的计数和
    逻辑思维： 数学家高斯推导出通用公式 sum = (a1+a2)*n/2
    计算思维：   程序代码
            sum = 0
            for i in range(1,101):
                s += 1
2.圆周率计算
    逻辑思维  π =
'''
