#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time : 2019/11/28 17:57
# @Author : liuhuiling
'''
描述
求100以内所有素数之和并输出。 ‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬
素数指从大于1，且仅能被1和自己整除的整数。‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬
提示：可以逐一判断100以内每个数是否为素数，然后求和。
输入输出示例   	输入	输出
示例 1	 	    无      1234（这是示例，不是真实输出）
'''
sum = 0
for i in range(2,101):
    for j in range(2, i + 1):
        if i % j == 0 and i != j:
            break
    else:
        sum += i
print(sum)