#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time : 2019/12/6 13:53
# @Author : liuhuiling
print()
'''
计算机与程序设计
计算机：根据指令操作数据的设备
    功能性：对数据的操作，表现为数据计算、输入输出处理和结果存储等
    可编程性：根据一系列指令，自动地、可预测地、准确地完成操作者的意图

编译和解释
- 源代码 采用某种编程语言编写的计算机程序，人类可读
- 目标代码 计算机可直接执行，人类不可读
编译 将源代码通过编译器转换成目标代码的过程 
解释 将源代码逐条转换成目标代码同时逐条运行的过程
静态语言 使用编译执行的编程语言
脚本语言 使用解释执行的编程语言

程序的基本编写方法
I Input输入，程序的输入
P Process处理，程序的主要逻辑，算法
O Output输出，程序的输出

理解问题的计算部分

编程解决问题的步骤
- 分析问题 分析问题的计算部分，想清楚
- 划分边界 划分问题的功能边界，规划IPO
- 设计算法 设计问题的求解算法，关注算法
- 编写程序：编写问题的计算程序，编程序
- 调试测试：调试程序使正确运行，运行调试
- 升级维护：适应问题的升级维护，更新完善

'''