#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time : 2019/12/6 9:48
# @Author : liuhuiling
'''
描述
获得用户输入的一个正整数输入，输出该数字对应的中文字符表示。‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬
0到9对应的中文字符分别是：零一二三四五六七八九‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬
‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬

输入输出示例              输入              输出
示例 1	                    123             一二三
                            9876543210      九八七六五四三二一零
'''
#我的答案
str =  input()
str0 = "零一二三四五六七八九"
str1 = ""
for i in range(len(str)):
    if str[i] == "0":
        str1 += str0[0]
    elif str[i] == "1":
        str1 += str0[1]
    elif str[i] == "2":
        str1 += str0[2]
    elif str[i] == "3":
        str1 += str0[3]
    elif str[i] == "4":
        str1 += str0[4]
    elif str[i] == "5":
        str1 += str0[5]
    elif str[i] == "6":
        str1 += str0[6]
    elif str[i] == "7":
        str1 += str0[7]
    elif str[i] == "8":
        str1 += str0[8]
    elif str[i] == "9":
        str1 += str0[9]
print(str1)

# 标准答案
template = "零一二三四五六七八九"
s = input()
for c in s:
    print(template[eval(c)], end="")
# print()中增加end=""参数表示输出后不增加换行，多个print()可以连续输出。